layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 256
      dim: 256
    }
  }
}

layer {
  name: "data_fixed"
  type: "FixedNeuron"
  bottom: "data"
  top: "data_fix"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: OVER_FLOW
    bit_width: 8
    follow_data_layer: true
  }
}
layer {
  name: "ConvNd_1"
  type: "ConvolutionFixed"
  bottom: "data_fix"
  top: "BatchNorm_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 3
    kernel_size: 7
    group: 1
    stride: 2
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_1"
  type: "ReLU"
  bottom: "BatchNorm_1"
  top: "BatchNorm_1"
}
layer {
  name: "BatchNorm_1_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_1"
  top: "BatchNorm_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_2"
  type: "ScaleFixed"
  bottom: "BatchNorm_1"
  top: "BatchNorm_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_2"
  type: "ReLU"
  bottom: "BatchNorm_2"
  top: "BatchNorm_2"
}
layer {
  name: "BatchNorm_2_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_2"
  top: "BatchNorm_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_2"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_2"
  top: "BatchNorm_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_3"
  type: "ReLU"
  bottom: "BatchNorm_3"
  top: "BatchNorm_3"
}
layer {
  name: "BatchNorm_3_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_3"
  top: "BatchNorm_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_3"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_3"
  top: "BatchNorm_4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_4"
  type: "ReLU"
  bottom: "BatchNorm_4"
  top: "BatchNorm_4"
}
layer {
  name: "BatchNorm_4_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_4"
  top: "BatchNorm_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_4"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_4"
  top: "ConvNd_4"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_4_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_4"
  top: "ConvNd_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_5"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_1"
  top: "ConvNd_5"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_5_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_5"
  top: "ConvNd_5"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_1"
  type: "Eltwise"
  bottom: "ConvNd_4"
  bottom: "ConvNd_5"
  top: "Add_1"
}
layer {
  name: "MaxPool2d_1"
  type: "Pooling"
  bottom: "Add_1"
  top: "MaxPool2d_1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "MaxPool2d_1_fixed"
  type: "FixedNeuron"
  bottom: "MaxPool2d_1"
  top: "MaxPool2d_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_5"
  type: "ScaleFixed"
  bottom: "MaxPool2d_1"
  top: "BatchNorm_5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_5"
  type: "ReLU"
  bottom: "BatchNorm_5"
  top: "BatchNorm_5"
}
layer {
  name: "BatchNorm_5_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_5"
  top: "BatchNorm_5"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_6"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_5"
  top: "BatchNorm_6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_6"
  type: "ReLU"
  bottom: "BatchNorm_6"
  top: "BatchNorm_6"
}
layer {
  name: "BatchNorm_6_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_6"
  top: "BatchNorm_6"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_7"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_6"
  top: "BatchNorm_7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_7"
  type: "ReLU"
  bottom: "BatchNorm_7"
  top: "BatchNorm_7"
}
layer {
  name: "BatchNorm_7_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_7"
  top: "BatchNorm_7"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_8"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_7"
  top: "ConvNd_8"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_8_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_8"
  top: "ConvNd_8"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_9"
  type: "ConvolutionFixed"
  bottom: "MaxPool2d_1"
  top: "ConvNd_9"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_9_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_9"
  top: "ConvNd_9"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_2"
  type: "Eltwise"
  bottom: "ConvNd_8"
  bottom: "ConvNd_9"
  top: "Add_2"
}
layer {
  name: "Add_2_fixed"
  type: "FixedNeuron"
  bottom: "Add_2"
  top: "Add_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_8"
  type: "ScaleFixed"
  bottom: "Add_2"
  top: "BatchNorm_8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_8"
  type: "ReLU"
  bottom: "BatchNorm_8"
  top: "BatchNorm_8"
}
layer {
  name: "BatchNorm_8_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_8"
  top: "BatchNorm_8"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_10"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_8"
  top: "BatchNorm_9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_9"
  type: "ReLU"
  bottom: "BatchNorm_9"
  top: "BatchNorm_9"
}
layer {
  name: "BatchNorm_9_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_9"
  top: "BatchNorm_9"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_11"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_9"
  top: "BatchNorm_10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_10"
  type: "ReLU"
  bottom: "BatchNorm_10"
  top: "BatchNorm_10"
}
layer {
  name: "BatchNorm_10_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_10"
  top: "BatchNorm_10"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_12"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_10"
  top: "ConvNd_12"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_12_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_12"
  top: "ConvNd_12"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_3"
  type: "Eltwise"
  bottom: "ConvNd_12"
  bottom: "Add_2"
  top: "Add_3"
}
layer {
  name: "Add_3_fixed"
  type: "FixedNeuron"
  bottom: "Add_3"
  top: "Add_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_11"
  type: "ScaleFixed"
  bottom: "Add_3"
  top: "BatchNorm_11"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_11"
  type: "ReLU"
  bottom: "BatchNorm_11"
  top: "BatchNorm_11"
}
layer {
  name: "BatchNorm_11_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_11"
  top: "BatchNorm_11"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_13"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_11"
  top: "BatchNorm_12"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_12"
  type: "ReLU"
  bottom: "BatchNorm_12"
  top: "BatchNorm_12"
}
layer {
  name: "BatchNorm_12_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_12"
  top: "BatchNorm_12"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_14"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_12"
  top: "BatchNorm_13"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_13"
  type: "ReLU"
  bottom: "BatchNorm_13"
  top: "BatchNorm_13"
}
layer {
  name: "BatchNorm_13_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_13"
  top: "BatchNorm_13"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_15"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_13"
  top: "ConvNd_15"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_15_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_15"
  top: "ConvNd_15"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_4"
  type: "Eltwise"
  bottom: "ConvNd_15"
  bottom: "Add_3"
  top: "Add_4"
}
layer {
  name: "Add_4_fixed"
  type: "FixedNeuron"
  bottom: "Add_4"
  top: "Add_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "MaxPool2d_2"
  type: "Pooling"
  bottom: "Add_3"
  top: "MaxPool2d_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "BatchNorm_14"
  type: "ScaleFixed"
  bottom: "MaxPool2d_2"
  top: "BatchNorm_14"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_14"
  type: "ReLU"
  bottom: "BatchNorm_14"
  top: "BatchNorm_14"
}
layer {
  name: "BatchNorm_14_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_14"
  top: "BatchNorm_14"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_16"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_14"
  top: "BatchNorm_15"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_15"
  type: "ReLU"
  bottom: "BatchNorm_15"
  top: "BatchNorm_15"
}
layer {
  name: "BatchNorm_15_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_15"
  top: "BatchNorm_15"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_17"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_15"
  top: "BatchNorm_16"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_16"
  type: "ReLU"
  bottom: "BatchNorm_16"
  top: "BatchNorm_16"
}
layer {
  name: "BatchNorm_16_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_16"
  top: "BatchNorm_16"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_18"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_16"
  top: "ConvNd_18"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_18_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_18"
  top: "ConvNd_18"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_5"
  type: "Eltwise"
  bottom: "ConvNd_18"
  bottom: "MaxPool2d_2"
  top: "Add_5"
}
layer {
  name: "Add_5_fixed"
  type: "FixedNeuron"
  bottom: "Add_5"
  top: "Add_5"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_17"
  type: "ScaleFixed"
  bottom: "Add_5"
  top: "BatchNorm_17"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_17"
  type: "ReLU"
  bottom: "BatchNorm_17"
  top: "BatchNorm_17"
}
layer {
  name: "BatchNorm_17_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_17"
  top: "BatchNorm_17"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_19"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_17"
  top: "BatchNorm_18"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_18"
  type: "ReLU"
  bottom: "BatchNorm_18"
  top: "BatchNorm_18"
}
layer {
  name: "BatchNorm_18_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_18"
  top: "BatchNorm_18"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_20"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_18"
  top: "BatchNorm_19"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_19"
  type: "ReLU"
  bottom: "BatchNorm_19"
  top: "BatchNorm_19"
}
layer {
  name: "BatchNorm_19_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_19"
  top: "BatchNorm_19"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_21"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_19"
  top: "ConvNd_21"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_21_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_21"
  top: "ConvNd_21"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_6"
  type: "Eltwise"
  bottom: "ConvNd_21"
  bottom: "Add_5"
  top: "Add_6"
}
layer {
  name: "Add_6_fixed"
  type: "FixedNeuron"
  bottom: "Add_6"
  top: "Add_6"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "MaxPool2d_3"
  type: "Pooling"
  bottom: "Add_5"
  top: "MaxPool2d_3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "BatchNorm_20"
  type: "ScaleFixed"
  bottom: "MaxPool2d_3"
  top: "BatchNorm_20"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_20"
  type: "ReLU"
  bottom: "BatchNorm_20"
  top: "BatchNorm_20"
}
layer {
  name: "BatchNorm_20_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_20"
  top: "BatchNorm_20"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_22"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_20"
  top: "BatchNorm_21"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_21"
  type: "ReLU"
  bottom: "BatchNorm_21"
  top: "BatchNorm_21"
}
layer {
  name: "BatchNorm_21_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_21"
  top: "BatchNorm_21"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_23"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_21"
  top: "BatchNorm_22"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_22"
  type: "ReLU"
  bottom: "BatchNorm_22"
  top: "BatchNorm_22"
}
layer {
  name: "BatchNorm_22_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_22"
  top: "BatchNorm_22"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_24"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_22"
  top: "ConvNd_24"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_24_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_24"
  top: "ConvNd_24"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_7"
  type: "Eltwise"
  bottom: "ConvNd_24"
  bottom: "MaxPool2d_3"
  top: "Add_7"
}
layer {
  name: "Add_7_fixed"
  type: "FixedNeuron"
  bottom: "Add_7"
  top: "Add_7"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_23"
  type: "ScaleFixed"
  bottom: "Add_7"
  top: "BatchNorm_23"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_23"
  type: "ReLU"
  bottom: "BatchNorm_23"
  top: "BatchNorm_23"
}
layer {
  name: "BatchNorm_23_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_23"
  top: "BatchNorm_23"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_25"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_23"
  top: "BatchNorm_24"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_24"
  type: "ReLU"
  bottom: "BatchNorm_24"
  top: "BatchNorm_24"
}
layer {
  name: "BatchNorm_24_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_24"
  top: "BatchNorm_24"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_26"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_24"
  top: "BatchNorm_25"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_25"
  type: "ReLU"
  bottom: "BatchNorm_25"
  top: "BatchNorm_25"
}
layer {
  name: "BatchNorm_25_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_25"
  top: "BatchNorm_25"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_27"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_25"
  top: "ConvNd_27"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_27_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_27"
  top: "ConvNd_27"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_8"
  type: "Eltwise"
  bottom: "ConvNd_27"
  bottom: "Add_7"
  top: "Add_8"
}
layer {
  name: "Add_8_fixed"
  type: "FixedNeuron"
  bottom: "Add_8"
  top: "Add_8"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "MaxPool2d_4"
  type: "Pooling"
  bottom: "Add_7"
  top: "MaxPool2d_4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "BatchNorm_26"
  type: "ScaleFixed"
  bottom: "MaxPool2d_4"
  top: "BatchNorm_26"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_26"
  type: "ReLU"
  bottom: "BatchNorm_26"
  top: "BatchNorm_26"
}
layer {
  name: "BatchNorm_26_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_26"
  top: "BatchNorm_26"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_28"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_26"
  top: "BatchNorm_27"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_27"
  type: "ReLU"
  bottom: "BatchNorm_27"
  top: "BatchNorm_27"
}
layer {
  name: "BatchNorm_27_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_27"
  top: "BatchNorm_27"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_29"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_27"
  top: "BatchNorm_28"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_28"
  type: "ReLU"
  bottom: "BatchNorm_28"
  top: "BatchNorm_28"
}
layer {
  name: "BatchNorm_28_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_28"
  top: "BatchNorm_28"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_30"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_28"
  top: "ConvNd_30"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_30_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_30"
  top: "ConvNd_30"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_9"
  type: "Eltwise"
  bottom: "ConvNd_30"
  bottom: "MaxPool2d_4"
  top: "Add_9"
}
layer {
  name: "Add_9_fixed"
  type: "FixedNeuron"
  bottom: "Add_9"
  top: "Add_9"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_29"
  type: "ScaleFixed"
  bottom: "Add_9"
  top: "BatchNorm_29"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_29"
  type: "ReLU"
  bottom: "BatchNorm_29"
  top: "BatchNorm_29"
}
layer {
  name: "BatchNorm_29_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_29"
  top: "BatchNorm_29"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_31"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_29"
  top: "BatchNorm_30"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_30"
  type: "ReLU"
  bottom: "BatchNorm_30"
  top: "BatchNorm_30"
}
layer {
  name: "BatchNorm_30_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_30"
  top: "BatchNorm_30"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_32"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_30"
  top: "BatchNorm_31"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_31"
  type: "ReLU"
  bottom: "BatchNorm_31"
  top: "BatchNorm_31"
}
layer {
  name: "BatchNorm_31_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_31"
  top: "BatchNorm_31"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_33"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_31"
  top: "ConvNd_33"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_33_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_33"
  top: "ConvNd_33"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_10"
  type: "Eltwise"
  bottom: "ConvNd_33"
  bottom: "Add_9"
  top: "Add_10"
}
layer {
  name: "Add_10_fixed"
  type: "FixedNeuron"
  bottom: "Add_10"
  top: "Add_10"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "MaxPool2d_5"
  type: "Pooling"
  bottom: "Add_9"
  top: "MaxPool2d_5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "BatchNorm_32"
  type: "ScaleFixed"
  bottom: "MaxPool2d_5"
  top: "BatchNorm_32"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_32"
  type: "ReLU"
  bottom: "BatchNorm_32"
  top: "BatchNorm_32"
}
layer {
  name: "BatchNorm_32_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_32"
  top: "BatchNorm_32"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_34"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_32"
  top: "BatchNorm_33"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_33"
  type: "ReLU"
  bottom: "BatchNorm_33"
  top: "BatchNorm_33"
}
layer {
  name: "BatchNorm_33_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_33"
  top: "BatchNorm_33"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_35"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_33"
  top: "BatchNorm_34"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_34"
  type: "ReLU"
  bottom: "BatchNorm_34"
  top: "BatchNorm_34"
}
layer {
  name: "BatchNorm_34_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_34"
  top: "BatchNorm_34"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_36"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_34"
  top: "ConvNd_36"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_36_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_36"
  top: "ConvNd_36"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_11"
  type: "Eltwise"
  bottom: "ConvNd_36"
  bottom: "MaxPool2d_5"
  top: "Add_11"
}
layer {
  name: "Add_11_fixed"
  type: "FixedNeuron"
  bottom: "Add_11"
  top: "Add_11"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_35"
  type: "ScaleFixed"
  bottom: "Add_11"
  top: "BatchNorm_35"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_35"
  type: "ReLU"
  bottom: "BatchNorm_35"
  top: "BatchNorm_35"
}
layer {
  name: "BatchNorm_35_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_35"
  top: "BatchNorm_35"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_37"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_35"
  top: "BatchNorm_36"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_36"
  type: "ReLU"
  bottom: "BatchNorm_36"
  top: "BatchNorm_36"
}
layer {
  name: "BatchNorm_36_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_36"
  top: "BatchNorm_36"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_38"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_36"
  top: "BatchNorm_37"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_37"
  type: "ReLU"
  bottom: "BatchNorm_37"
  top: "BatchNorm_37"
}
layer {
  name: "BatchNorm_37_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_37"
  top: "BatchNorm_37"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_39"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_37"
  top: "ConvNd_39"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_39_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_39"
  top: "ConvNd_39"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_12"
  type: "Eltwise"
  bottom: "ConvNd_39"
  bottom: "Add_11"
  top: "Add_12"
}
layer {
  name: "Add_12_fixed"
  type: "FixedNeuron"
  bottom: "Add_12"
  top: "Add_12"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_38"
  type: "ScaleFixed"
  bottom: "Add_12"
  top: "BatchNorm_38"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_38"
  type: "ReLU"
  bottom: "BatchNorm_38"
  top: "BatchNorm_38"
}
layer {
  name: "BatchNorm_38_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_38"
  top: "BatchNorm_38"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_40"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_38"
  top: "BatchNorm_39"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_39"
  type: "ReLU"
  bottom: "BatchNorm_39"
  top: "BatchNorm_39"
}
layer {
  name: "BatchNorm_39_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_39"
  top: "BatchNorm_39"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_41"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_39"
  top: "BatchNorm_40"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_40"
  type: "ReLU"
  bottom: "BatchNorm_40"
  top: "BatchNorm_40"
}
layer {
  name: "BatchNorm_40_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_40"
  top: "BatchNorm_40"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_42"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_40"
  top: "ConvNd_42"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_42_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_42"
  top: "ConvNd_42"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_13"
  type: "Eltwise"
  bottom: "ConvNd_42"
  bottom: "Add_12"
  top: "Add_13"
}
layer {
  name: "Add_13_fixed"
  type: "FixedNeuron"
  bottom: "Add_13"
  top: "Add_13"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "UpsamplingBilinear2d_1"
  type: "DeconvolutionFixed"
  bottom: "Add_13"
  top: "UpsamplingBilinear2d_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 256
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "UpsamplingBilinear2d_1_fixed"
  type: "FixedNeuron"
  bottom: "UpsamplingBilinear2d_1"
  top: "UpsamplingBilinear2d_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_14"
  type: "Eltwise"
  bottom: "Add_10"
  bottom: "UpsamplingBilinear2d_1"
  top: "Add_14"
}
layer {
  name: "Add_14_fixed"
  type: "FixedNeuron"
  bottom: "Add_14"
  top: "Add_14"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_41"
  type: "ScaleFixed"
  bottom: "Add_14"
  top: "BatchNorm_41"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_41"
  type: "ReLU"
  bottom: "BatchNorm_41"
  top: "BatchNorm_41"
}
layer {
  name: "BatchNorm_41_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_41"
  top: "BatchNorm_41"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_43"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_41"
  top: "BatchNorm_42"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_42"
  type: "ReLU"
  bottom: "BatchNorm_42"
  top: "BatchNorm_42"
}
layer {
  name: "BatchNorm_42_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_42"
  top: "BatchNorm_42"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_44"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_42"
  top: "BatchNorm_43"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_43"
  type: "ReLU"
  bottom: "BatchNorm_43"
  top: "BatchNorm_43"
}
layer {
  name: "BatchNorm_43_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_43"
  top: "BatchNorm_43"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_45"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_43"
  top: "ConvNd_45"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_45_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_45"
  top: "ConvNd_45"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_15"
  type: "Eltwise"
  bottom: "ConvNd_45"
  bottom: "Add_14"
  top: "Add_15"
}
layer {
  name: "Add_15_fixed"
  type: "FixedNeuron"
  bottom: "Add_15"
  top: "Add_15"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "UpsamplingBilinear2d_2"
  type: "DeconvolutionFixed"
  bottom: "Add_15"
  top: "UpsamplingBilinear2d_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 256
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "UpsamplingBilinear2d_2_fixed"
  type: "FixedNeuron"
  bottom: "UpsamplingBilinear2d_2"
  top: "UpsamplingBilinear2d_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_16"
  type: "Eltwise"
  bottom: "Add_8"
  bottom: "UpsamplingBilinear2d_2"
  top: "Add_16"
}
layer {
  name: "Add_16_fixed"
  type: "FixedNeuron"
  bottom: "Add_16"
  top: "Add_16"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_44"
  type: "ScaleFixed"
  bottom: "Add_16"
  top: "BatchNorm_44"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_44"
  type: "ReLU"
  bottom: "BatchNorm_44"
  top: "BatchNorm_44"
}
layer {
  name: "BatchNorm_44_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_44"
  top: "BatchNorm_44"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_46"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_44"
  top: "BatchNorm_45"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_45"
  type: "ReLU"
  bottom: "BatchNorm_45"
  top: "BatchNorm_45"
}
layer {
  name: "BatchNorm_45_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_45"
  top: "BatchNorm_45"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_47"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_45"
  top: "BatchNorm_46"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_46"
  type: "ReLU"
  bottom: "BatchNorm_46"
  top: "BatchNorm_46"
}
layer {
  name: "BatchNorm_46_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_46"
  top: "BatchNorm_46"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_48"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_46"
  top: "ConvNd_48"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_48_fixed"
  type: "FixedNeuron"
  bottom: "ConvNd_48"
  top: "ConvNd_48"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_17"
  type: "Eltwise"
  bottom: "ConvNd_48"
  bottom: "Add_16"
  top: "Add_17"
}
layer {
  name: "Add_17_fixed"
  type: "FixedNeuron"
  bottom: "Add_17"
  top: "Add_17"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "UpsamplingBilinear2d_3"
  type: "DeconvolutionFixed"
  bottom: "Add_17"
  top: "UpsamplingBilinear2d_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 256
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "UpsamplingBilinear2d_3_fixed"
  type: "FixedNeuron"
  bottom: "UpsamplingBilinear2d_3"
  top: "UpsamplingBilinear2d_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Add_18"
  type: "Eltwise"
  bottom: "Add_6"
  bottom: "UpsamplingBilinear2d_3"
  top: "Add_18"
}
layer {
  name: "Add_18_fixed"
  type: "FixedNeuron"
  bottom: "Add_18"
  top: "Add_18"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "BatchNorm_47"
  type: "ScaleFixed"
  bottom: "Add_18"
  top: "BatchNorm_47"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_47"
  type: "ReLU"
  bottom: "BatchNorm_47"
  top: "BatchNorm_47"
}
layer {
  name: "BatchNorm_47_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_47"
  top: "BatchNorm_47"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_49"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_47"
  top: "BatchNorm_48"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "Threshold_48"
  type: "ReLU"
  bottom: "BatchNorm_48"
  top: "BatchNorm_48"
}
layer {
  name: "BatchNorm_48_fixed"
  type: "FixedNeuron"
  bottom: "BatchNorm_48"
  top: "BatchNorm_48"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  fixed_param {
    fixed_method: DIFF_S
    bit_width: 8
  }
}
layer {
  name: "ConvNd_50"
  type: "ConvolutionFixed"
  bottom: "BatchNorm_48"
  top: "BatchNorm_49"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  fixed_param {
    fixed_method: DIFF_S
