layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 256
      dim: 256
    }
  }
}
layer {
  name: "ConvNd_1"
  type: "Convolution"
  bottom: "data"
  top: "ConvNd_1"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 3
    kernel_size: 7
    group: 1
    stride: 2
    dilation: 1
  }
}
layer {
  name: "BatchNorm_1"
  type: "BatchNorm"
  bottom: "ConvNd_1"
  top: "BatchNorm_1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_1"
  type: "ReLU"
  bottom: "BatchNorm_1"
  top: "BatchNorm_1"
}
layer {
  name: "BatchNorm_2"
  type: "BatchNorm"
  bottom: "BatchNorm_1"
  top: "BatchNorm_2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_2"
  type: "ReLU"
  bottom: "BatchNorm_2"
  top: "BatchNorm_2"
}
layer {
  name: "ConvNd_2"
  type: "Convolution"
  bottom: "BatchNorm_2"
  top: "ConvNd_2"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_3"
  type: "BatchNorm"
  bottom: "ConvNd_2"
  top: "BatchNorm_3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_3"
  type: "ReLU"
  bottom: "BatchNorm_3"
  top: "BatchNorm_3"
}
layer {
  name: "ConvNd_3"
  type: "Convolution"
  bottom: "BatchNorm_3"
  top: "ConvNd_3"
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_4"
  type: "BatchNorm"
  bottom: "ConvNd_3"
  top: "BatchNorm_4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_4"
  type: "ReLU"
  bottom: "BatchNorm_4"
  top: "BatchNorm_4"
}
layer {
  name: "ConvNd_4"
  type: "Convolution"
  bottom: "BatchNorm_4"
  top: "ConvNd_4"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "ConvNd_5"
  type: "Convolution"
  bottom: "BatchNorm_1"
  top: "ConvNd_5"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_1"
  type: "Eltwise"
  bottom: "ConvNd_4"
  bottom: "ConvNd_5"
  top: "Add_1"
}
layer {
  name: "MaxPool2d_1"
  type: "Pooling"
  bottom: "Add_1"
  top: "MaxPool2d_1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "BatchNorm_5"
  type: "BatchNorm"
  bottom: "MaxPool2d_1"
  top: "BatchNorm_5"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_5"
  type: "ReLU"
  bottom: "BatchNorm_5"
  top: "BatchNorm_5"
}
layer {
  name: "ConvNd_6"
  type: "Convolution"
  bottom: "BatchNorm_5"
  top: "ConvNd_6"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_6"
  type: "BatchNorm"
  bottom: "ConvNd_6"
  top: "BatchNorm_6"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_6"
  type: "ReLU"
  bottom: "BatchNorm_6"
  top: "BatchNorm_6"
}
layer {
  name: "ConvNd_7"
  type: "Convolution"
  bottom: "BatchNorm_6"
  top: "ConvNd_7"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_7"
  type: "BatchNorm"
  bottom: "ConvNd_7"
  top: "BatchNorm_7"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_7"
  type: "ReLU"
  bottom: "BatchNorm_7"
  top: "BatchNorm_7"
}
layer {
  name: "ConvNd_8"
  type: "Convolution"
  bottom: "BatchNorm_7"
  top: "ConvNd_8"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "ConvNd_9"
  type: "Convolution"
  bottom: "MaxPool2d_1"
  top: "ConvNd_9"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_2"
  type: "Eltwise"
  bottom: "ConvNd_8"
  bottom: "ConvNd_9"
  top: "Add_2"
}
layer {
  name: "BatchNorm_8"
  type: "BatchNorm"
  bottom: "Add_2"
  top: "BatchNorm_8"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_8"
  type: "ReLU"
  bottom: "BatchNorm_8"
  top: "BatchNorm_8"
}
layer {
  name: "ConvNd_10"
  type: "Convolution"
  bottom: "BatchNorm_8"
  top: "ConvNd_10"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_9"
  type: "BatchNorm"
  bottom: "ConvNd_10"
  top: "BatchNorm_9"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_9"
  type: "ReLU"
  bottom: "BatchNorm_9"
  top: "BatchNorm_9"
}
layer {
  name: "ConvNd_11"
  type: "Convolution"
  bottom: "BatchNorm_9"
  top: "ConvNd_11"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_10"
  type: "BatchNorm"
  bottom: "ConvNd_11"
  top: "BatchNorm_10"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_10"
  type: "ReLU"
  bottom: "BatchNorm_10"
  top: "BatchNorm_10"
}
layer {
  name: "ConvNd_12"
  type: "Convolution"
  bottom: "BatchNorm_10"
  top: "ConvNd_12"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_3"
  type: "Eltwise"
  bottom: "ConvNd_12"
  bottom: "Add_2"
  top: "Add_3"
}
layer {
  name: "BatchNorm_11"
  type: "BatchNorm"
  bottom: "Add_3"
  top: "BatchNorm_11"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_11"
  type: "ReLU"
  bottom: "BatchNorm_11"
  top: "BatchNorm_11"
}
layer {
  name: "ConvNd_13"
  type: "Convolution"
  bottom: "BatchNorm_11"
  top: "ConvNd_13"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_12"
  type: "BatchNorm"
  bottom: "ConvNd_13"
  top: "BatchNorm_12"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_12"
  type: "ReLU"
  bottom: "BatchNorm_12"
  top: "BatchNorm_12"
}
layer {
  name: "ConvNd_14"
  type: "Convolution"
  bottom: "BatchNorm_12"
  top: "ConvNd_14"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_13"
  type: "BatchNorm"
  bottom: "ConvNd_14"
  top: "BatchNorm_13"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_13"
  type: "ReLU"
  bottom: "BatchNorm_13"
  top: "BatchNorm_13"
}
layer {
  name: "ConvNd_15"
  type: "Convolution"
  bottom: "BatchNorm_13"
  top: "ConvNd_15"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_4"
  type: "Eltwise"
  bottom: "ConvNd_15"
  bottom: "Add_3"
  top: "Add_4"
}
layer {
  name: "MaxPool2d_2"
  type: "Pooling"
  bottom: "Add_3"
  top: "MaxPool2d_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "BatchNorm_14"
  type: "BatchNorm"
  bottom: "MaxPool2d_2"
  top: "BatchNorm_14"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_14"
  type: "ReLU"
  bottom: "BatchNorm_14"
  top: "BatchNorm_14"
}
layer {
  name: "ConvNd_16"
  type: "Convolution"
  bottom: "BatchNorm_14"
  top: "ConvNd_16"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_15"
  type: "BatchNorm"
  bottom: "ConvNd_16"
  top: "BatchNorm_15"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_15"
  type: "ReLU"
  bottom: "BatchNorm_15"
  top: "BatchNorm_15"
}
layer {
  name: "ConvNd_17"
  type: "Convolution"
  bottom: "BatchNorm_15"
  top: "ConvNd_17"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_16"
  type: "BatchNorm"
  bottom: "ConvNd_17"
  top: "BatchNorm_16"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_16"
  type: "ReLU"
  bottom: "BatchNorm_16"
  top: "BatchNorm_16"
}
layer {
  name: "ConvNd_18"
  type: "Convolution"
  bottom: "BatchNorm_16"
  top: "ConvNd_18"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_5"
  type: "Eltwise"
  bottom: "ConvNd_18"
  bottom: "MaxPool2d_2"
  top: "Add_5"
}
layer {
  name: "BatchNorm_17"
  type: "BatchNorm"
  bottom: "Add_5"
  top: "BatchNorm_17"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_17"
  type: "ReLU"
  bottom: "BatchNorm_17"
  top: "BatchNorm_17"
}
layer {
  name: "ConvNd_19"
  type: "Convolution"
  bottom: "BatchNorm_17"
  top: "ConvNd_19"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_18"
  type: "BatchNorm"
  bottom: "ConvNd_19"
  top: "BatchNorm_18"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_18"
  type: "ReLU"
  bottom: "BatchNorm_18"
  top: "BatchNorm_18"
}
layer {
  name: "ConvNd_20"
  type: "Convolution"
  bottom: "BatchNorm_18"
  top: "ConvNd_20"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_19"
  type: "BatchNorm"
  bottom: "ConvNd_20"
  top: "BatchNorm_19"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_19"
  type: "ReLU"
  bottom: "BatchNorm_19"
  top: "BatchNorm_19"
}
layer {
  name: "ConvNd_21"
  type: "Convolution"
  bottom: "BatchNorm_19"
  top: "ConvNd_21"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_6"
  type: "Eltwise"
  bottom: "ConvNd_21"
  bottom: "Add_5"
  top: "Add_6"
}
layer {
  name: "MaxPool2d_3"
  type: "Pooling"
  bottom: "Add_5"
  top: "MaxPool2d_3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "BatchNorm_20"
  type: "BatchNorm"
  bottom: "MaxPool2d_3"
  top: "BatchNorm_20"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_20"
  type: "ReLU"
  bottom: "BatchNorm_20"
  top: "BatchNorm_20"
}
layer {
  name: "ConvNd_22"
  type: "Convolution"
  bottom: "BatchNorm_20"
  top: "ConvNd_22"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_21"
  type: "BatchNorm"
  bottom: "ConvNd_22"
  top: "BatchNorm_21"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_21"
  type: "ReLU"
  bottom: "BatchNorm_21"
  top: "BatchNorm_21"
}
layer {
  name: "ConvNd_23"
  type: "Convolution"
  bottom: "BatchNorm_21"
  top: "ConvNd_23"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_22"
  type: "BatchNorm"
  bottom: "ConvNd_23"
  top: "BatchNorm_22"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_22"
  type: "ReLU"
  bottom: "BatchNorm_22"
  top: "BatchNorm_22"
}
layer {
  name: "ConvNd_24"
  type: "Convolution"
  bottom: "BatchNorm_22"
  top: "ConvNd_24"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_7"
  type: "Eltwise"
  bottom: "ConvNd_24"
  bottom: "MaxPool2d_3"
  top: "Add_7"
}
layer {
  name: "BatchNorm_23"
  type: "BatchNorm"
  bottom: "Add_7"
  top: "BatchNorm_23"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_23"
  type: "ReLU"
  bottom: "BatchNorm_23"
  top: "BatchNorm_23"
}
layer {
  name: "ConvNd_25"
  type: "Convolution"
  bottom: "BatchNorm_23"
  top: "ConvNd_25"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_24"
  type: "BatchNorm"
  bottom: "ConvNd_25"
  top: "BatchNorm_24"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_24"
  type: "ReLU"
  bottom: "BatchNorm_24"
  top: "BatchNorm_24"
}
layer {
  name: "ConvNd_26"
  type: "Convolution"
  bottom: "BatchNorm_24"
  top: "ConvNd_26"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_25"
  type: "BatchNorm"
  bottom: "ConvNd_26"
  top: "BatchNorm_25"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_25"
  type: "ReLU"
  bottom: "BatchNorm_25"
  top: "BatchNorm_25"
}
layer {
  name: "ConvNd_27"
  type: "Convolution"
  bottom: "BatchNorm_25"
  top: "ConvNd_27"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_8"
  type: "Eltwise"
  bottom: "ConvNd_27"
  bottom: "Add_7"
  top: "Add_8"
}
layer {
  name: "MaxPool2d_4"
  type: "Pooling"
  bottom: "Add_7"
  top: "MaxPool2d_4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "BatchNorm_26"
  type: "BatchNorm"
  bottom: "MaxPool2d_4"
  top: "BatchNorm_26"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_26"
  type: "ReLU"
  bottom: "BatchNorm_26"
  top: "BatchNorm_26"
}
layer {
  name: "ConvNd_28"
  type: "Convolution"
  bottom: "BatchNorm_26"
  top: "ConvNd_28"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_27"
  type: "BatchNorm"
  bottom: "ConvNd_28"
  top: "BatchNorm_27"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_27"
  type: "ReLU"
  bottom: "BatchNorm_27"
  top: "BatchNorm_27"
}
layer {
  name: "ConvNd_29"
  type: "Convolution"
  bottom: "BatchNorm_27"
  top: "ConvNd_29"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_28"
  type: "BatchNorm"
  bottom: "ConvNd_29"
  top: "BatchNorm_28"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_28"
  type: "ReLU"
  bottom: "BatchNorm_28"
  top: "BatchNorm_28"
}
layer {
  name: "ConvNd_30"
  type: "Convolution"
  bottom: "BatchNorm_28"
  top: "ConvNd_30"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_9"
  type: "Eltwise"
  bottom: "ConvNd_30"
  bottom: "MaxPool2d_4"
  top: "Add_9"
}
layer {
  name: "BatchNorm_29"
  type: "BatchNorm"
  bottom: "Add_9"
  top: "BatchNorm_29"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_29"
  type: "ReLU"
  bottom: "BatchNorm_29"
  top: "BatchNorm_29"
}
layer {
  name: "ConvNd_31"
  type: "Convolution"
  bottom: "BatchNorm_29"
  top: "ConvNd_31"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_30"
  type: "BatchNorm"
  bottom: "ConvNd_31"
  top: "BatchNorm_30"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_30"
  type: "ReLU"
  bottom: "BatchNorm_30"
  top: "BatchNorm_30"
}
layer {
  name: "ConvNd_32"
  type: "Convolution"
  bottom: "BatchNorm_30"
  top: "ConvNd_32"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_31"
  type: "BatchNorm"
  bottom: "ConvNd_32"
  top: "BatchNorm_31"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_31"
  type: "ReLU"
  bottom: "BatchNorm_31"
  top: "BatchNorm_31"
}
layer {
  name: "ConvNd_33"
  type: "Convolution"
  bottom: "BatchNorm_31"
  top: "ConvNd_33"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_10"
  type: "Eltwise"
  bottom: "ConvNd_33"
  bottom: "Add_9"
  top: "Add_10"
}
layer {
  name: "MaxPool2d_5"
  type: "Pooling"
  bottom: "Add_9"
  top: "MaxPool2d_5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "BatchNorm_32"
  type: "BatchNorm"
  bottom: "MaxPool2d_5"
  top: "BatchNorm_32"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_32"
  type: "ReLU"
  bottom: "BatchNorm_32"
  top: "BatchNorm_32"
}
layer {
  name: "ConvNd_34"
  type: "Convolution"
  bottom: "BatchNorm_32"
  top: "ConvNd_34"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_33"
  type: "BatchNorm"
  bottom: "ConvNd_34"
  top: "BatchNorm_33"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_33"
  type: "ReLU"
  bottom: "BatchNorm_33"
  top: "BatchNorm_33"
}
layer {
  name: "ConvNd_35"
  type: "Convolution"
  bottom: "BatchNorm_33"
  top: "ConvNd_35"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_34"
  type: "BatchNorm"
  bottom: "ConvNd_35"
  top: "BatchNorm_34"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_34"
  type: "ReLU"
  bottom: "BatchNorm_34"
  top: "BatchNorm_34"
}
layer {
  name: "ConvNd_36"
  type: "Convolution"
  bottom: "BatchNorm_34"
  top: "ConvNd_36"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_11"
  type: "Eltwise"
  bottom: "ConvNd_36"
  bottom: "MaxPool2d_5"
  top: "Add_11"
}
layer {
  name: "BatchNorm_35"
  type: "BatchNorm"
  bottom: "Add_11"
  top: "BatchNorm_35"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_35"
  type: "ReLU"
  bottom: "BatchNorm_35"
  top: "BatchNorm_35"
}
layer {
  name: "ConvNd_37"
  type: "Convolution"
  bottom: "BatchNorm_35"
  top: "ConvNd_37"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_36"
  type: "BatchNorm"
  bottom: "ConvNd_37"
  top: "BatchNorm_36"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_36"
  type: "ReLU"
  bottom: "BatchNorm_36"
  top: "BatchNorm_36"
}
layer {
  name: "ConvNd_38"
  type: "Convolution"
  bottom: "BatchNorm_36"
  top: "ConvNd_38"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_37"
  type: "BatchNorm"
  bottom: "ConvNd_38"
  top: "BatchNorm_37"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_37"
  type: "ReLU"
  bottom: "BatchNorm_37"
  top: "BatchNorm_37"
}
layer {
  name: "ConvNd_39"
  type: "Convolution"
  bottom: "BatchNorm_37"
  top: "ConvNd_39"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_12"
  type: "Eltwise"
  bottom: "ConvNd_39"
  bottom: "Add_11"
  top: "Add_12"
}
layer {
  name: "BatchNorm_38"
  type: "BatchNorm"
  bottom: "Add_12"
  top: "BatchNorm_38"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_38"
  type: "ReLU"
  bottom: "BatchNorm_38"
  top: "BatchNorm_38"
}
layer {
  name: "ConvNd_40"
  type: "Convolution"
  bottom: "BatchNorm_38"
  top: "ConvNd_40"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_39"
  type: "BatchNorm"
  bottom: "ConvNd_40"
  top: "BatchNorm_39"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_39"
  type: "ReLU"
  bottom: "BatchNorm_39"
  top: "BatchNorm_39"
}
layer {
  name: "ConvNd_41"
  type: "Convolution"
  bottom: "BatchNorm_39"
  top: "ConvNd_41"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_40"
  type: "BatchNorm"
  bottom: "ConvNd_41"
  top: "BatchNorm_40"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_40"
  type: "ReLU"
  bottom: "BatchNorm_40"
  top: "BatchNorm_40"
}
layer {
  name: "ConvNd_42"
  type: "Convolution"
  bottom: "BatchNorm_40"
  top: "ConvNd_42"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_13"
  type: "Eltwise"
  bottom: "ConvNd_42"
  bottom: "Add_12"
  top: "Add_13"
}
layer {
  name: "UpsamplingBilinear2d_1"
  type: "Deconvolution"
  bottom: "Add_13"
  top: "UpsamplingBilinear2d_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 256
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "Add_14"
  type: "Eltwise"
  bottom: "Add_10"
  bottom: "UpsamplingBilinear2d_1"
  top: "Add_14"
}
layer {
  name: "BatchNorm_41"
  type: "BatchNorm"
  bottom: "Add_14"
  top: "BatchNorm_41"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_41"
  type: "ReLU"
  bottom: "BatchNorm_41"
  top: "BatchNorm_41"
}
layer {
  name: "ConvNd_43"
  type: "Convolution"
  bottom: "BatchNorm_41"
  top: "ConvNd_43"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_42"
  type: "BatchNorm"
  bottom: "ConvNd_43"
  top: "BatchNorm_42"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_42"
  type: "ReLU"
  bottom: "BatchNorm_42"
  top: "BatchNorm_42"
}
layer {
  name: "ConvNd_44"
  type: "Convolution"
  bottom: "BatchNorm_42"
  top: "ConvNd_44"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_43"
  type: "BatchNorm"
  bottom: "ConvNd_44"
  top: "BatchNorm_43"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_43"
  type: "ReLU"
  bottom: "BatchNorm_43"
  top: "BatchNorm_43"
}
layer {
  name: "ConvNd_45"
  type: "Convolution"
  bottom: "BatchNorm_43"
  top: "ConvNd_45"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_15"
  type: "Eltwise"
  bottom: "ConvNd_45"
  bottom: "Add_14"
  top: "Add_15"
}
layer {
  name: "UpsamplingBilinear2d_2"
  type: "Deconvolution"
  bottom: "Add_15"
  top: "UpsamplingBilinear2d_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 256
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "Add_16"
  type: "Eltwise"
  bottom: "Add_8"
  bottom: "UpsamplingBilinear2d_2"
  top: "Add_16"
}
layer {
  name: "BatchNorm_44"
  type: "BatchNorm"
  bottom: "Add_16"
  top: "BatchNorm_44"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_44"
  type: "ReLU"
  bottom: "BatchNorm_44"
  top: "BatchNorm_44"
}
layer {
  name: "ConvNd_46"
  type: "Convolution"
  bottom: "BatchNorm_44"
  top: "ConvNd_46"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_45"
  type: "BatchNorm"
  bottom: "ConvNd_46"
  top: "BatchNorm_45"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_45"
  type: "ReLU"
  bottom: "BatchNorm_45"
  top: "BatchNorm_45"
}
layer {
  name: "ConvNd_47"
  type: "Convolution"
  bottom: "BatchNorm_45"
  top: "ConvNd_47"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_46"
  type: "BatchNorm"
  bottom: "ConvNd_47"
  top: "BatchNorm_46"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_46"
  type: "ReLU"
  bottom: "BatchNorm_46"
  top: "BatchNorm_46"
}
layer {
  name: "ConvNd_48"
  type: "Convolution"
  bottom: "BatchNorm_46"
  top: "ConvNd_48"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_17"
  type: "Eltwise"
  bottom: "ConvNd_48"
  bottom: "Add_16"
  top: "Add_17"
}
layer {
  name: "UpsamplingBilinear2d_3"
  type: "Deconvolution"
  bottom: "Add_17"
  top: "UpsamplingBilinear2d_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 256
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "Add_18"
  type: "Eltwise"
  bottom: "Add_6"
  bottom: "UpsamplingBilinear2d_3"
  top: "Add_18"
}
layer {
  name: "BatchNorm_47"
  type: "BatchNorm"
  bottom: "Add_18"
  top: "BatchNorm_47"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_47"
  type: "ReLU"
  bottom: "BatchNorm_47"
  top: "BatchNorm_47"
}
layer {
  name: "ConvNd_49"
  type: "Convolution"
  bottom: "BatchNorm_47"
  top: "ConvNd_49"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_48"
  type: "BatchNorm"
  bottom: "ConvNd_49"
  top: "BatchNorm_48"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_48"
  type: "ReLU"
  bottom: "BatchNorm_48"
  top: "BatchNorm_48"
}
layer {
  name: "ConvNd_50"
  type: "Convolution"
  bottom: "BatchNorm_48"
  top: "ConvNd_50"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_49"
  type: "BatchNorm"
  bottom: "ConvNd_50"
  top: "BatchNorm_49"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_49"
  type: "ReLU"
  bottom: "BatchNorm_49"
  top: "BatchNorm_49"
}
layer {
  name: "ConvNd_51"
  type: "Convolution"
  bottom: "BatchNorm_49"
  top: "ConvNd_51"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_19"
  type: "Eltwise"
  bottom: "ConvNd_51"
  bottom: "Add_18"
  top: "Add_19"
}
layer {
  name: "UpsamplingBilinear2d_4"
  type: "Deconvolution"
  bottom: "Add_19"
  top: "UpsamplingBilinear2d_4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 256
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "Add_20"
  type: "Eltwise"
  bottom: "Add_4"
  bottom: "UpsamplingBilinear2d_4"
  top: "Add_20"
}
layer {
  name: "BatchNorm_50"
  type: "BatchNorm"
  bottom: "Add_20"
  top: "BatchNorm_50"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_50"
  type: "ReLU"
  bottom: "BatchNorm_50"
  top: "BatchNorm_50"
}
layer {
  name: "ConvNd_52"
  type: "Convolution"
  bottom: "BatchNorm_50"
  top: "ConvNd_52"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_51"
  type: "BatchNorm"
  bottom: "ConvNd_52"
  top: "BatchNorm_51"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_51"
  type: "ReLU"
  bottom: "BatchNorm_51"
  top: "BatchNorm_51"
}
layer {
  name: "ConvNd_53"
  type: "Convolution"
  bottom: "BatchNorm_51"
  top: "ConvNd_53"
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_52"
  type: "BatchNorm"
  bottom: "ConvNd_53"
  top: "BatchNorm_52"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_52"
  type: "ReLU"
  bottom: "BatchNorm_52"
  top: "BatchNorm_52"
}
layer {
  name: "ConvNd_54"
  type: "Convolution"
  bottom: "BatchNorm_52"
  top: "ConvNd_54"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "Add_21"
  type: "Eltwise"
  bottom: "ConvNd_54"
  bottom: "Add_20"
  top: "Add_21"
}
layer {
  name: "ConvNd_55"
  type: "Convolution"
  bottom: "Add_21"
  top: "ConvNd_55"
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
layer {
  name: "BatchNorm_53"
  type: "BatchNorm"
  bottom: "ConvNd_55"
  top: "BatchNorm_53"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Threshold_53"
  type: "ReLU"
  bottom: "BatchNorm_53"
  top: "BatchNorm_53"
}
layer {
  name: "ConvNd_56"
  type: "Convolution"
  bottom: "BatchNorm_53"
  top: "ConvNd_56"
  convolution_param {
    num_output: 16
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
}
